"""

Домашнее задание №1

Цикл while: ask_user

* Напишите функцию ask_user(), которая с помощью input() спрашивает 
  пользователя “Как дела?”, пока он не ответит “Хорошо”
   
"""

question = input ("Как дела?")
def ask_user(question):
    print(quesion)
    while True:
      user_say = 'Хорошо'
      
      break
    
        
        
    
if __name__ == "__main__":
    ask_user("question")
